aaron-bond.better-comments
adpyke.codesnap
akamud.vscode-theme-onedark
ataraxindev.chatgpt-color-theme
austenc.tailwind-docs
batisteo.vscode-django
beardedbear.beardedtheme
bianxianyang.htmlplay
blanu.vscode-styled-jsx
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
brandonjmatthews.one-dark-dark-plus
brapifra.phpserver
burkeholland.simple-react-snippets
charliermarsh.ruff
christian-kohler.npm-intellisense
clemenspeters.format-json
codingyu.laravel-goto-view
davidbwaters.macos-modern-theme
dbaeumer.vscode-eslint
devsense.composer-php-vscode
devsense.intelli-php-vscode
devsense.phptools-vscode
devsense.profiler-php-vscode
digitalbrainstem.javascript-ejs-support
docker.docker
donjayamanne.githistory
donjayamanne.jquerysnippets
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dsznajder.es7-react-js-snippets
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
eserozvataf.one-dark-pro-monokai-darker
ferdelamad.styled-snippets
firefox-devtools.vscode-firefox-debug
formulahendry.auto-rename-tag
formulahendry.code-runner
github.copilot
github.copilot-chat
github.github-vscode-theme
github.vscode-pull-request-github
grapecity.gc-excelviewer
hediet.vscode-drawio
hnw.vscode-auto-open-markdown-preview
hridoy.jquery-snippets
igorsbitnev.error-gutters
jmkrivocapich.drawfolderstructure
johnguo.columnpaste
johnpapa.vscode-peacock
jonkwheeler.styled-components-snippets
kevinrose.vsc-python-indent
killalau.vscode-liquid-snippets
kirchner-trevor.shopify-liquid-preview
kisstkondoros.vscode-gutter-preview
mattwarwick.html-preview-with-bootstrap-jquery
mechatroner.rainbow-csv
monokai.theme-monokai-pro-vscode
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-dotnettools.vscodeintellicode-csharp
ms-edgedevtools.vscode-edge-devtools
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.live-server
ms-vsliveshare.vsliveshare
ms-windows-ai-studio.windows-ai-studio
muhammad-ahmad.xlsx-viewer
naumovs.color-highlight
naumovs.theme-oceanicnext
neilbrayfield.php-docblocker
neilding.language-liquid
nextbook.file-and-folder-icons
njpwerner.autodocstring
onecentlin.laravel-blade
onecentlin.laravel5-snippets
openai.chatgpt
orta.vscode-jest
peyman-borhani.perfect-dark
pkief.material-icon-theme
redis.redis-for-vscode
repreng.csv
ritwickdey.liveserver
sdras.night-owl
shahilkumar.readme-parser
shape.shape-shopify-autocomplete
shopify.theme-check-vscode
sissel.shopify-liquid
solnurkarim.html-to-css-autocompletion
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-dutch
styled-components.vscode-styled-components
stylelint.vscode-stylelint
sudhan.neondark-theme
sumitnalavade.vscode-readme-editor
tamasfe.even-better-toml
teabyii.ayu
teamsdevapp.vscode-ai-foundry
tonybaloney.vscode-pets
tushortz.python-extended-snippets
usernamehw.errorlens
viktorqvarfordt.vscode-pitch-black-theme
vue.volar
wayou.vscode-todo-highlight
ways-agency.shopify-liquid-snippets
wholroyd.jinja
will-stone.plastic
woodreamz.es7-react-js-snippets
wooodhead.disable-eslint-rule
xdebug.php-debug
xicunyang.ts-space-prompt
yandeu.five-server
zarifprogrammer.tailwind-snippets
zhuangtongfa.material-theme



install -> cat extensions.txt | xargs -n 1 code --install-extension
